Create empty dataframe

In [8]:
import pandas as pd
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

Create dataframe from Lists

In [10]:
data=['A','B','C','D','E']
df = pd.DataFrame(data)
df

   0
0  A
1  B
2  C
3  D
4  E

In [12]:
data = [['Jack',10],['Riya',12],['Jill',15]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

   Name   Age
0  Jack  10.0
1  Riya  12.0
2  Jill  15.0

Create a DataFrame from Dict of arrays/lists

In [13]:
data = {'Name':['Jack', 'Riya', 'Jill', 'Ricky'],'Age':[20,23,21,22]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1   Jack   20
rank2   Riya   23
rank3   Jill   21
rank4  Ricky   22

Create a Dataframes from list of Dicts

In [14]:
data = [{'a': 1, 'b': 2, 'c': 10},{'a': 3, 'b': 4}]
df = pd.DataFrame(data)
df

   a  b     c
0  1  2  10.0
1  3  4   NaN

Create a DataFrame from Dict of series

In [15]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

Column Addition

In [18]:
d = {'one' : pd.Series([1, 2, 3,4], index=['a', 'b', 'c','d']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)


print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
df

print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']

df

Adding a new column by passing as Series:
Adding a new column using the existing columns in DataFrame:

   one  two  three  four
a    1    1   10.0  11.0
b    2    2   20.0  22.0
c    3    3   30.0  33.0
d    4    4    NaN   NaN

Column Deletion

In [21]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'four' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)


# using del function
print ("Deleting the first column using DEL function:")
del df['one']


# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
df

Deleting the first column using DEL function:
Deleting another column using POP function:

   four
a  10.0
b  20.0
c  30.0
d   NaN

Row Selection, Addition, and Deletion

Selection by Label

In [23]:
d = {'one' : pd.Series([1, 2, 3,4], index=['a', 'b', 'c','d']), 
   'two' : pd.Series([1, 2, 3], index=['a', 'b', 'c'])}

df = pd.DataFrame(d)
df.loc['c']

one    3.0
two    3.0
Name: c, dtype: float64

Selection by integer location

In [24]:
d = {'one' : pd.Series([1, 2, 3,4], index=['a', 'b', 'c','d']), 
   'two' : pd.Series([1, 2, 3], index=['a', 'b', 'c'])}

df = pd.DataFrame(d)
df.iloc[2]

one    3.0
two    3.0
Name: c, dtype: float64

Slice Rows using ':' operator.

In [25]:
d = {'one' : pd.Series([1, 2, 3,4], index=['a', 'b', 'c','d']), 
   'two' : pd.Series([1, 2, 3], index=['a', 'b', 'c'])}

df = pd.DataFrame(d)
df [2:4]

   one  two
c    3  3.0
d    4  NaN

Addition of Rows using append()

In [26]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

Deletion of Rows using delete or drop

In [29]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)


df = df.drop(1)

df

   a  b
0  1  2
0  5  6